; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v7 - type_3 ?v8 - type_2)
 	      (pred_3 ?v5 - object ?v8 - type_2)
	      (pred_1 ?v7 - type_3 ?v3 - type_1)
	      (pred_4 ?v7 - type_3 ?v5 - object ?v3 - type_1))

   (:action op_1
       :parameters  (?v7 - type_3 ?v4 ?v1 - type_2)
       :precondition (and  (pred_2 ?v7 ?v4))
       :effect (and  (pred_2 ?v7 ?v1)
		     (not (pred_2 ?v7 ?v4))))

   (:action op_3
       :parameters (?v7 - type_3 ?v6 - object ?v2 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v2) (pred_2 ?v7 ?v2) (pred_1 ?v7 ?v3))
       :effect (and (pred_4 ?v7 ?v6 ?v3)
		    (not (pred_3 ?v6 ?v2)) 
		    (not (pred_1 ?v7 ?v3))))

   (:action op_2
       :parameters (?v7 - type_3 ?v6 - object ?v2 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v6 ?v3) (pred_2 ?v7 ?v2))
       :effect (and (pred_3 ?v6 ?v2)
		    (pred_1 ?v7 ?v3)
		    (not (pred_4 ?v7 ?v6 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_02 - type_3
obj_01 obj_06 obj_11 obj_04 - type_1
obj_09 obj_03 obj_08 obj_05 - type_2
obj_13 obj_07 obj_10 - object)
(:init
(pred_2 obj_12 obj_08)
(pred_1 obj_12 obj_01)
(pred_1 obj_12 obj_06)
(pred_2 obj_02 obj_08)
(pred_1 obj_02 obj_11)
(pred_1 obj_02 obj_04)
(pred_3 obj_13 obj_08)
(pred_3 obj_07 obj_03)
(pred_3 obj_10 obj_05)
)
(:goal
(and
(pred_3 obj_13 obj_08)
(pred_3 obj_07 obj_08)
(pred_3 obj_10 obj_03)
)
)

(:constraints
  (always (not (pred_2 obj_12 obj_05)))
)
)

; plan
1. (op_1 obj_12 obj_08 obj_03)
   deleted: (pred_2 obj_12 obj_08)
   added: (pred_2 obj_12 obj_03)
   goals met: 1 of 3
2. (op_1 obj_02 obj_08 obj_05)
   deleted: (pred_2 obj_02 obj_08)
   added: (pred_2 obj_02 obj_05)
   goals met: 1 of 3
3. (op_3 obj_02 obj_10 obj_05 obj_04)
   deleted: (pred_3 obj_10 obj_05) (pred_1 obj_02 obj_04)
   added: (pred_4 obj_02 obj_10 obj_04)
   goals met: 1 of 3
4. (op_3 obj_12 obj_07 obj_03 obj_06)
   deleted: (pred_3 obj_07 obj_03) (pred_1 obj_12 obj_06)
   added: (pred_4 obj_12 obj_07 obj_06)
   goals met: 1 of 3
5. (op_1 obj_02 obj_05 obj_03)
   deleted: (pred_2 obj_02 obj_05)
   added: (pred_2 obj_02 obj_03)
   goals met: 1 of 3
6. (op_1 obj_12 obj_03 obj_08)
   deleted: (pred_2 obj_12 obj_03)
   added: (pred_2 obj_12 obj_08)
   goals met: 1 of 3
7. (op_2 obj_12 obj_07 obj_08 obj_06)
   deleted: (pred_4 obj_12 obj_07 obj_06)
   added: (pred_3 obj_07 obj_08) (pred_1 obj_12 obj_06)
   goals met: 2 of 3
8. (op_2 obj_02 obj_10 obj_03 obj_04)
   deleted: (pred_4 obj_02 obj_10 obj_04)
   added: (pred_3 obj_10 obj_03) (pred_1 obj_02 obj_04)
   goals met: 3 of 3
